---
kind: method
id: M:Autodesk.Revit.DB.ReloadSwapOutInfo.Dispose
source: html/2eb61735-a63f-055e-2b23-4e8d3cc1a020.htm
---
# Autodesk.Revit.DB.ReloadSwapOutInfo.Dispose Method

Releases all resources used by the ReloadSwapOutInfo

## Syntax (C#)
```csharp
public void Dispose()
```